In [65]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OneHotEncoder

Understand your Data

In [44]:
data = pd.read_csv("Titanic-Dataset.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [45]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [46]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [47]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Fill Null Values, If a particular feature has lot of null values, See the impact and make a decision to either drop it.

In [48]:
data['Age'].fillna(data['Age'].median(),inplace=True)

data['Embarked'].fillna(data['Embarked'].mode()[0], inplace=True)

data.drop(columns=['Cabin'],inplace= True)

/var/folders/jp/rhphdm796l7gd4g5f66syv4w0000gn/T/ipykernel_61422/1873796968.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Age'].fillna(data['Age'].median(),inplace=True)
/var/folders/jp/rhphdm796l7gd4g5f66syv4w0000gn/T/ipykernel_61422/1873796968.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Embarked'].fillna(data['Embarked'].mode()[0], inplace=True)

In [49]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q

Feature Creation - Create meaningful feature for your data to make sense and make the analysis easy.

In [50]:
all_titles = [' Capt', ' Col', ' Don', ' Dr', ' Jonkheer', ' Lady', ' Major',' Master', ' Miss', ' Mlle', ' Mme', ' Mr', ' Mrs', ' Ms', ' Rev', ' Sir', ' the Countess']

data['Title'] = data['Name'].str.extract(' ([A-Za-z]+)\.', expand=False) # Regex for Name : Braund, Mr. Owen Harris -- Mr is selected.

# Simplify rare titles into one category
rare_titles = ['Lady', 'Countess','Capt', 'Col','Don','Dr','Major','Rev','Sir','Jonkheer','Dona']
data['Title'] = data['Title'].replace(rare_titles, 'Rare')
data['Title'] = data['Title'].replace({'Mlle':'Miss', 'Ms':'Miss', 'Mme':'Mrs'})

In [51]:
data['Family_Size'] = data["SibSp"] + data['Parch'] + 1

In [52]:
data['IsAlone'] = 1  # Initialize to 1 (alone)
data['IsAlone'].loc[data['Family_Size'] > 1] = 0

/var/folders/jp/rhphdm796l7gd4g5f66syv4w0000gn/T/ipykernel_61422/3935362496.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  data['IsAlone'].loc[data['Family_Size'] > 1] = 0
/var/folders/jp/rhphdm796l7gd4g5f66syv4w0000gn/T/ipykernel_61422/3935362496.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['IsAlone'].loc[data['Family_Size'] > 1] = 0

In [53]:
data.loc[data['Age'] <= 16, 'AgeGroup'] = 0
data.loc[(data['Age'] > 16) & (data['Age'] <= 32), 'AgeGroup'] = 1
data.loc[(data['Age'] > 32) & (data['Age'] <= 48), 'AgeGroup'] = 2
data.loc[(data['Age'] > 48) & (data['Age'] <= 64), 'AgeGroup'] = 3
data.loc[data['Age'] > 64, 'AgeGroup'] = 4

In [55]:
data['AgeBand'] = pd.cut(data['Age'],5)

In [56]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title,Family_Size,IsAlone,AgeGroup,AgeBand
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,Mr,2,0,1.0,"(16.336, 32.252]"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,Mrs,2,0,2.0,"(32.252, 48.168]"
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,Miss,1,1,1.0,"(16.336, 32.252]"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,Mrs,2,0,2.0,"(32.252, 48.168]"
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,Mr,1,1,2.0,"(32.252, 48.168]"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,S,Rare,1,1,1.0,"(16.336, 32.252]"
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,S,Miss,1,1,1.0,"(16.336, 32.252]"
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,S,Miss,4,0,1.0,"(16.336, 32.252]"
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C,Mr,1,1,1.0,"(16.336, 32.252]"
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,Q,Mr,1,1,1.0,"(16.336, 32.252]"

In [57]:
data['Sex'] = data['Sex'].map({'male':0,'female':1})

In [ ]:
# One-hot encode 'Embarked'
embarked_dummies = pd.get_dummies(data['Embarked'], prefix='Embarked')
data = pd.concat([data, embarked_dummies], axis=1)

# One-hot encode 'Title'
title_dummies = pd.get_dummies(data['Title'], prefix='Title')
data = pd.concat([data, title_dummies], axis=1)

In [68]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,AgeGroup,AgeBand,Embarked_C,Embarked_Q,Embarked_S,Title_Master,Title_Miss,Title_Mr,Title_Mrs,Title_Rare
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,...,1.0,"(16.336, 32.252]",False,False,True,False,False,True,False,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,...,2.0,"(32.252, 48.168]",True,False,False,False,False,False,True,False
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,...,1.0,"(16.336, 32.252]",False,False,True,False,True,False,False,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,...,2.0,"(32.252, 48.168]",False,False,True,False,False,False,True,False
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,...,2.0,"(32.252, 48.168]",False,False,True,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",0,27.0,0,0,211536,13.0000,...,1.0,"(16.336, 32.252]",False,False,True,False,False,False,False,True
887,888,1,1,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.0000,...,1.0,"(16.336, 32.252]",False,False,True,False,True,False,False,False
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,28.0,1,2,W./C. 6607,23.4500,...,1.0,"(16.336, 32.252]",False,False,True,False,True,False,False,False
889,890,1,1,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.0000,...,1.0,"(16.336, 32.252]",True,False,False,False,False,True,False,False
890,891,0,3,"Dooley, Mr. Patrick",0,32.0,0,0,370376,7.7500,...,1.0,"(16.336, 32.252]",False,True,False,False,False,True,False,False

In [69]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
data['Fare_scaled'] = scaler.fit_transform(data[['Fare']])
data['Age_scaled'] = scaler.fit_transform(data[['Age']])

In [72]:
ageband_dummies = pd.get_dummies(data['AgeBand'], prefix='AgeBand')
data = pd.concat([data, ageband_dummies], axis=1)

In [74]:
print(data.dtypes)

PassengerId                    int64
Survived                       int64
Pclass                         int64
Name                          object
Sex                            int64
Age                          float64
SibSp                          int64
Parch                          int64
Ticket                        object
Fare                         float64
Embarked                      object
Title                         object
Family_Size                    int64
IsAlone                        int64
AgeGroup                     float64
AgeBand                     category
Embarked_C                      bool
Embarked_Q                      bool
Embarked_S                      bool
Title_Master                    bool
Title_Miss                      bool
Title_Mr                        bool
Title_Mrs                       bool
Title_Rare                      bool
Fare_scaled                  float64
Age_scaled                   float64
AgeBand_(0.34, 16.336]          bool
AgeBand_(16.336, 32.252]        bool
AgeBand_(32.252, 48.168]        bool
AgeBand_(48.168, 64.084]        bool
AgeBand_(64.084, 80.0]          bool
dtype: object

In [75]:
from sklearn.ensemble import RandomForestClassifier

X = data.drop(['Survived', 'Name', 'Ticket', 'Embarked', 'Title','AgeBand'], axis=1)
y = data['Survived']

model = RandomForestClassifier()
model.fit(X, y)

# Feature importance
importances = model.feature_importances_
feature_names = X.columns
importance_df = pd.DataFrame({'Feature': feature_names, 'Importance': importances})
print(importance_df.sort_values(by='Importance', ascending=False))

                     Feature  Importance
0                PassengerId    0.123137
15                  Title_Mr    0.117286
18               Fare_scaled    0.110081
6                       Fare    0.105209
2                        Sex    0.105022
19                Age_scaled    0.075636
3                        Age    0.074004
1                     Pclass    0.059296
7                Family_Size    0.039692
16                 Title_Mrs    0.035282
14                Title_Miss    0.030979
4                      SibSp    0.028167
5                      Parch    0.013764
9                   AgeGroup    0.012143
12                Embarked_S    0.010896
10                Embarked_C    0.010019
8                    IsAlone    0.009236
17                Title_Rare    0.006999
11                Embarked_Q    0.006496
21  AgeBand_(16.336, 32.252]    0.006276
13              Title_Master    0.005980
22  AgeBand_(32.252, 48.168]    0.005907
23  AgeBand_(48.168, 64.084]    0.003614
20    AgeBand_(0.34, 16.336]    0.003480
24    AgeBand_(64.084, 80.0]    0.001400